Name: Juan Pablo Meza

Email: Juanpablo.meza604@gmail.com

This program creates a Pandas Series and DataFrame

In [1]:
import numpy as np
import pandas as pd
from numpy import random

Part A: Creating a Series

In [2]:
data = np.array([7,11,13,17])
series = pd.Series(data)

series

0     7
1    11
2    13
3    17
dtype: int64

In [3]:
data1 = np.array([100.0,100.0,100.0,100.0,100.0])
series1 = pd.Series(data1)

series1

0    100.0
1    100.0
2    100.0
3    100.0
4    100.0
dtype: float64

In [4]:
data2 = random.randint(100, size = (20))
series2 = pd.Series(data2)

print(data2)
print('\n')
series2.describe()

[29 13 94 16 16 91 78  6 18 31 83 20 16 90 18 69 75 36 67 76]

count    20.000000
mean     47.100000
std      32.111483
min       6.000000
25%      17.500000
50%      33.500000
75%      76.500000
max      94.000000
dtype: float64

In [5]:
temperatures = np.array([98.6,98.9,100.2,97.9])
series3 = pd.Series(temperatures, index = ('Julie','Charlie','Sam','Andrea'))
series3

Julie       98.6
Charlie     98.9
Sam        100.2
Andrea      97.9
dtype: float64

In [6]:
dic = {'Names': ['Julie','Charlie','Sam','Andrea'], 'Temperatures': [98.6,98.9,100.2,97.9]}
series4 = pd.Series(dic)

series4

Names           [Julie, Charlie, Sam, Andrea]
Temperatures        [98.6, 98.9, 100.2, 97.9]
dtype: object

Part B: Dataframes

In [7]:
dictionary = {'Maxine': [65,85,72],'James': [35,54,48], 'Amanda': [82,101,94]}
temperatures = pd.DataFrame(dictionary)

temperatures

   Maxine  James  Amanda
0      65     35      82
1      85     54     101
2      72     48      94

In [8]:
temperatures = pd.DataFrame(dictionary, index = ('Morning','Afternoon','Evening'))

temperatures

           Maxine  James  Amanda
Morning        65     35      82
Afternoon      85     54     101
Evening        72     48      94

In [9]:
temperatures[['Maxine']]

           Maxine
Morning        65
Afternoon      85
Evening        72

In [10]:
temperatures.loc[['Morning'],:]

         Maxine  James  Amanda
Morning      65     35      82

In [11]:
temperatures.loc[['Morning','Evening'],:]

         Maxine  James  Amanda
Morning      65     35      82
Evening      72     48      94

In [12]:
temperatures.loc[:,['Amanda','Maxine']]

           Amanda  Maxine
Morning        82      65
Afternoon     101      85
Evening        94      72

In [13]:
temperatures.loc[['Morning','Afternoon'],['Amanda','Maxine']]

           Amanda  Maxine
Morning        82      65
Afternoon     101      85

In [14]:
temperatures.describe()

          Maxine      James      Amanda
count   3.000000   3.000000    3.000000
mean   74.000000  45.666667   92.333333
std    10.148892   9.712535    9.609024
min    65.000000  35.000000   82.000000
25%    68.500000  41.500000   88.000000
50%    72.000000  48.000000   94.000000
75%    78.500000  51.000000   97.500000
max    85.000000  54.000000  101.000000

In [15]:
temperatures.transpose()

        Morning  Afternoon  Evening
Maxine       65         85       72
James        35         54       48
Amanda       82        101       94

In [16]:
temperatures.reindex(sorted(temperatures.columns), axis = 1)

           Amanda  James  Maxine
Morning        82     35      65
Afternoon     101     54      85
Evening        94     48      72